; domain
;Header and description

(define (domain clean-robot)

;import needed requirements
(:requirements :strips :negative-preconditions :typing)

;define types box and robot just for simplicity
(:types box - movable robot - movable office)

; There is always only one robot so it can be 
; defined as a constant
(:constants R - robot)

(:predicates
 (at ?B - movable ?o - office) ; The object B is at office o
 (adj ?o1 ?o2 - office) ; The offices o1 and o2 are adjacent
 (dirty ?o - office) ; The office o is dirty
 (empty ?o - office) ; There is no box at office o
)

(:action clean
    :parameters (?o - office)
    :precondition (and (at R ?o) ; The robot is at office o
                       (dirty ?o) ; The office o is dirty
                    )
    :effect (and (not (dirty ?o)) ; The office o is not dirty anymore
            )
)

(:action move
    :parameters (?o1 ?o2 - office)
    :precondition (and (adj ?o1 ?o2) ; Both offices are adjacent
                        (at R ?o1) ; The robot is at office o1
                   )
    :effect (and (not (at R ?o1)) ; The robot is not at office o1 anymore
                 (at R ?o2) ; The robot is now at office o2
            )
)

(:action push
    :parameters (?B - box ?o1 ?o2 - office)
    :precondition (and (at R ?o1) ; The robot is at office o1
                       (adj ?o1 ?o2) ; Both offices are adjacent
                       (at ?B ?o1) (empty ?o2) ; The box B is at o1 and o2 is empty
                   )
    :effect (and (at R ?o2) (not (at R ?o1)) ; Move the robot to o2
                 (at ?B ?o2) (not (at ?B ?o1)) ; Move the box to o2
                 (not (empty ?o2)) (empty ?o1) ; o2 is not empty anymore and o1 is empty
            )
)



;define actions here

)

; problem
(define (problem NCELL25) (:domain clean-robot)
(:objects
    o1 o2 o3 o4 o5 o6 o7 o8 o9 o10 o11 o12 o13 o14 o15 o16 o17 o18 o19 o20 o21 o22 o23 o24 o25 - office ; Offices
    A B - box    ; Boxes
)

(:init

 ; Adjacency conditions
 (adj o1 o2) (adj o2 o1)
 (adj o1 o6) (adj o6 o1)

 (adj o2 o3) (adj o3 o2)
 (adj o2 o7) (adj o7 o2)

 (adj o3 o4) (adj o4 o3)
 (adj o3 o8) (adj o8 o3)

 (adj o4 o5) (adj o5 o4) 
 (adj o4 o9) (adj o9 o4)

 (adj o5 o10) (adj o10 o5)

 (adj o6 o7) (adj o7 o6)
 (adj o6 o11) (adj o11 o6)

 (adj o7 o8) (adj o8 o7)
 (adj o7 o12) (adj o12 o7)

 (adj o8 o9) (adj o9 o8) 
 (adj o8 o13) (adj o13 o8)

 (adj o9 o10) (adj o10 o9) 
 (adj o9 o14) (adj o14 o9)

 (adj o10 o15) (adj o15 o10)
 
    (adj o11 o12) (adj o12 o11)
    (adj o11 o16) (adj o16 o11)

    (adj o12 o13) (adj o13 o12)
    (adj o12 o17) (adj o17 o12)

    (adj o13 o14) (adj o14 o13)
    (adj o13 o18) (adj o18 o13)

    (adj o14 o15) (adj o15 o14)
    (adj o14 o19) (adj o19 o14)

    (adj o15 o20) (adj o20 o15)

    (adj o16 o17) (adj o17 o16)
    (adj o16 o21) (adj o21 o16)

    (adj o17 o18) (adj o18 o17)
    (adj o17 o22) (adj o22 o17)

    (adj o18 o19) (adj o19 o18)
    (adj o18 o23) (adj o23 o18)

    (adj o19 o20) (adj o20 o19)
    (adj o19 o24) (adj o24 o19)

    (adj o20 o25) (adj o25 o20)

    (adj o21 o22) (adj o22 o21)

    (adj o22 o23) (adj o23 o22)

    (adj o23 o24) (adj o24 o23)

    (adj o24 o25) (adj o25 o24)

 ; Robot initial location
 (at R o21)

 ; Box initial locations map
 (at A o1) (empty o2) (empty o3) (empty o4) (empty o5) 
 (empty o6) (empty o7) (empty o8) (empty o9) (empty o10) 
 (empty o11) (empty o12) (empty o13) (empty o14) (empty o15)
 (empty o16) (empty o17) (empty o18) (empty o19) (empty o20) 
 (empty o21) (empty o22) (empty o23) (empty o24) (at B o25)

 ; Dirty offices
 (dirty o4)
 (dirty o16)

)

(:goal (and
    ; Robot final location
    (at R o5)

    ; Clean offices
    (not (dirty o4))
    (not (dirty o16))

    ; Boxes final locations
    (at A o2) (at B o23)

))
)

; plan
1. (move o21 o16)
   deleted: (at r o21)
   added: (at r o16)
   goals met: 0 of 5
2. (clean o16)
   deleted: (dirty o16)
   goals met: 1 of 5
3. (move o16 o11)
   deleted: (at r o16)
   added: (at r o11)
   goals met: 1 of 5
4. (move o11 o6)
   deleted: (at r o11)
   added: (at r o6)
   goals met: 1 of 5
5. (move o6 o1)
   deleted: (at r o6)
   added: (at r o1)
   goals met: 1 of 5
6. (push a o1 o2)
   deleted: (at r o1) (at a o1) (empty o2)
   added: (at r o2) (at a o2) (empty o1)
   goals met: 2 of 5
7. (move o2 o3)
   deleted: (at r o2)
   added: (at r o3)
   goals met: 2 of 5
8. (move o3 o4)
   deleted: (at r o3)
   added: (at r o4)
   goals met: 2 of 5
9. (clean o4)
   deleted: (dirty o4)
   goals met: 3 of 5
10. (move o4 o5)
   deleted: (at r o4)
   added: (at r o5)
   goals met: 4 of 5
11. (move o5 o10)
   deleted: (at r o5)
   added: (at r o10)
   goals met: 3 of 5
12. (move o10 o15)
   deleted: (at r o10)
   added: (at r o15)
   goals met: 3 of 5
13. (move o15 o20)
   deleted: (at r o15)
   added: (at r o20)
   goals met: 3 of 5
14. (move o20 o25)
   deleted: (at r o20)
   added: (at r o25)
   goals met: 3 of 5
15. (push b o25 o24)
   deleted: (at r o25) (at b o25) (empty o24)
   added: (at r o24) (at b o24) (empty o25)
   goals met: 3 of 5
16. (push b o24 o23)
   deleted: (at r o24) (at b o24) (empty o23)
   added: (at r o23) (at b o23) (empty o24)
   goals met: 4 of 5
17. (move o23 o24)
   deleted: (at r o23)
   added: (at r o24)
   goals met: 4 of 5
18. (move o24 o25)
   deleted: (at r o24)
   added: (at r o25)
   goals met: 4 of 5
19. (move o25 o20)
   deleted: (at r o25)
   added: (at r o20)
   goals met: 4 of 5
20. (move o20 o15)
   deleted: (at r o20)
   added: (at r o15)
   goals met: 4 of 5
21. (move o15 o10)
   deleted: (at r o15)
   added: (at r o10)
   goals met: 4 of 5
22. (move o10 o5)
   deleted: (at r o10)
   added: (at r o5)
   goals met: 5 of 5
